PAGE_NUMBERS = [ 
    "0️⃣", "1️⃣", "2️⃣", "3️⃣", "4️⃣", 
    "5️⃣", "6️⃣", "7️⃣", "8️⃣", "9️⃣" 
]

TEXT_CANCELLED = "Скасовано."

TEXT_LOCATION = "Назва: {}\nРейтинг: {} / 5\n\n{}"
TEXT_LOCATIONS = "Локаії ({} - {})"
TEXT_UNVERIFIED_LOCATION = (
    "Запропонована локація:\nНазва: {}\n\n{}"
)
TEXT_UNVERIFIED_LOCATIONS = "Запропоновані локаії ({} - {})"
TEXT_NEW_LOCATION = "Нова локація: {}"
TEXT_LOCATION_PUBLISHIED = "Локація опублікована. Дякуємо за співпрацю!"

TEXT_COMMENT = "Анонімний відгук: {}"
TEXT_WRITE_COMMENT = "Напишіть Ваше враження про локацію."
TEXT_WRITE_COMMENT_FINISH = (
    "Дякуємо за допомогу! Ваш відгук може повпливати на опис"
)

TEXT_WELCOME = (
    "Я - бот, створений для допомоги жителям селища "
    "Карнаухівка. Для подробиць тисніть кнопку \"Детальніше\"."
)
TEXT_DETAILS = (
    "Сенс боту - надати мешканцям селища можливість дізнатись "
    "нового про своє селище. Він дасть відповідь на питання: "
    "\"А де можна сьогодні погуляти?\", запропонувавши цікаві "
    "та популярні локації, в залежності від Ваших потреб. "
    "Більшість локацій має фото або відео, тому Ви можете "
    "одразу побачити, що Вас там буде чекає. Але якщо фото чи "
    "відео немає, ви все одно зможете дізнатись багато "
    "інформації про локацію, бо до кожної з них йде детальний "
    "опис, історичні факти та рейтинг, завдяки якому Ви "
    "можете швидко дізнатись актуальність локації.\n\n"

    "Також Ви можете допомогти боту, запропонувавши свою "
    "локацію. Вона перевіриться модераторами і буде додана "
    "до списку."
)

TEXT_SUGGESTION_1 = (
    "Спочатку напишіть коротку назву локації. Якщо "
    "передумали, натисніть кнопку \"Скасувати\""
)
TEXT_SUGGESTION_2 = (
    "Тепер напишіть інформацію про локацію у такому форматі: "
    "скидуйте повідомлення(розміром до 3000 символів), які "
    "будуть сторінками. Коли ви напишете всю інформацію, то "
    "натисніть на кнопку \"Все\"."
)
TEXT_SUGGESTION_3 = (
    "Наостанок можете надіслати декілька фото чи відео. Коли "
    "завершите, натисніть кнопку \"Все\"."
)
TEXT_SUGGESTION_FINISH = (
    "Дякуємо за внесок у нашого з Вами боту, цим Ви робите "
    "наше селище краще! Локація у найближчий час буде "
    "перевірена модераторами."
)
TEXT_SUGGESTION_PAGE_LIMIT = (
    "Довжина сторінки більша за 3000 символів({}), тому вона "
    "не була зарахована."
)

TEXT_ADMIN_AUTHORIZE_1 = "Напишіть ім'я в системі"
TEXT_ADMIN_AUTHORIZE_2 = "Напишіть пароль"
TEXT_ADMIN_AUTHORIZED = "Ви авторизовані в системі."
TEXT_LOGOUT_ADMIN = "Ви вийшли з системи."
TEXT_NOT_AUTHORIZED = "Ви не авторизовані в системі."
TEXT_ALREADY_AUTHORIZED = "Ви вже авторизовані в системі."
TEXT_INCORRECT_ADMIN_DATA = "Неправильне ім'я або пароль."

BUTTON_DONE = "Все"
BUTTON_HIDE = "Приховати"
BUTTON_CANCEL = "Скасувати"
BUTTON_DETAILS = "Детальніше"
BUTTON_LOCATIONS = "Локації"
BUTTON_COMMENTS = "Коментарі"
BUTTON_REVIEW_LOCATIONS = "Перевірити локації"
BUTTON_SUGGEST_LOCATION = "Запропонувати локацію"


if __name__ == "__main__":
    with open("consts.txt", "w", encoding="UTF-8") as f:
        f.write("\n".join(
            f"{k}: {v}"
            for k, v in globals().items()
            if k.startswith("TEXT") or k.startswith("BUTTON")
        ))
